{"data":{"type":"contents","id":"ember","attributes":{"html":"<p><a href=\"https://emberjs.com/\">Ember is a powerful Javascript Framework that is designed to maximise developer productivity</a>. Ember also has one of the best plugin experiences in the industry, which means you can get a whole lot of functionality with just a simple <code>npm install</code>. If you want to check out the power of <a href=\"https://emberobserver.com/\">Ember's addon ecosystem</a> you can visit <a href=\"https://emberobserver.com/\">Ember Observer</a> which is made by <a href=\"http://www.codeallday.com/\">Code All Day</a>.</p>\n<p>The design of empress-blog is a direct result of the work done to upgrade the <a href=\"https://github.com/ember-learn/guides-app\">Ember Guides into an Ember application</a>. This system is specifically designed to make it easy for you to get started and if you have followed the <a href=\"https://github.com/empress/empress-blog\">instructions on the README</a> you will know exactly how easy it is. If you are familiar with Ember you are probably used to the Zero Config experience of setting up new applications and adding addons 🎉</p>","content":"[Ember is a powerful Javascript Framework that is designed to maximise developer productivity](https://emberjs.com/). Ember also has one of the best plugin experiences in the industry, which means you can get a whole lot of functionality with just a simple `npm install`. If you want to check out the power of [Ember's addon ecosystem](https://emberobserver.com/) you can visit [Ember Observer](https://emberobserver.com/) which is made by [Code All Day](http://www.codeallday.com/).\n\nThe design of empress-blog is a direct result of the work done to upgrade the [Ember Guides into an Ember application](https://github.com/ember-learn/guides-app). This system is specifically designed to make it easy for you to get started and if you have followed the [instructions on the README](https://github.com/empress/empress-blog) you will know exactly how easy it is. If you are familiar with Ember you are probably used to the Zero Config experience of setting up new applications and adding addons 🎉","title":"Why Ember","date":"Tue Jun 12 2018 17:50:59 GMT+0100 (IST)","featured":true,"image":"/images/ember.jpg","imageMeta":{"attribution":"by Robert Wagner","attributionLink":"https://unsplash.com/photos/OM4TjQwHC1I"}},"relationships":{"authors":{"data":[{"type":"authors","id":"chris"}]},"tags":{"data":[{"type":"tags","id":"getting-started"}]}}}}