{"data":{"type":"contents","id":"running-component-css-and-css-modules-in-the-same-app","attributes":{"html":"<p>With Ember Octane <a href=\"https://blog.emberjs.com/2019/12/20/octane-is-here.html\">now released</a> it's a good time to start looking at upgrading that app. One of the issues we faced at Crash with upgrading is that Ember Component CSS doesn't support Glimmer components and even breaks on classic components because of some changes to the framework. So we decided to run Component CSS alongside CSS Modules, because we have a good amount of CSS (as do most apps). I won't go into why we decided to use CSS Modules (a post coming in the future on this topic), but I will show you how to get them running together.</p>\n<p>First, install both dependencies. Second you need to tell Component CSS to not run CSS Module files, so add this to your <code>config/environment.js</code>:</p>\n<pre><code>ENV['ember-component-css'] = {\n  // ignore css-modules styles\n  excludeFromManifest: ['**/*.module.scss']\n};\n</code></pre>\n<p>We decided to use <code>styles.module.scss</code> as the name for CSS Modules, and Component CSS uses <code>styles.scss</code>. To get CSS Modules to use this format, we need another config, this time in <code>ember-cli-build.js</code></p>\n<pre><code>const nested = require('postcss-nested');\n// ...\ncssModules: {\n  extension: 'module.scss',\n  intermediateOutputPath: 'app/styles/_modules.scss',\n  plugins: {\n    before: [nested]\n  }\n},\n</code></pre>\n<blockquote>\n  <p>Notice that you need to install <code>postcss-nested</code> to allow for nested syntax and nested <code>:global</code> selector.</p>\n</blockquote>\n<p>Now in <code>app/styles/app.scss</code> you need to add the modules import after the pods import:</p>\n<pre><code class=\"scss language-scss\">@import 'pod-styles.scss';\n@import 'modules';\n</code></pre>\n<p>Don't forget to also install <code>ember-css-modules-sass</code> to support SASS. And that should be it, let me know if you run into any issues on Twitter.</p>","content":"With Ember Octane [now released](https://blog.emberjs.com/2019/12/20/octane-is-here.html) it's a good time to start looking at upgrading that app. One of the issues we faced at Crash with upgrading is that Ember Component CSS doesn't support Glimmer components and even breaks on classic components because of some changes to the framework. So we decided to run Component CSS alongside CSS Modules, because we have a good amount of CSS (as do most apps). I won't go into why we decided to use CSS Modules (a post coming in the future on this topic), but I will show you how to get them running together.\n\nFirst, install both dependencies. Second you need to tell Component CSS to not run CSS Module files, so add this to your `config/environment.js`:\n\n```\nENV['ember-component-css'] = {\n  // ignore css-modules styles\n  excludeFromManifest: ['**/*.module.scss']\n};\n```\n\nWe decided to use `styles.module.scss` as the name for CSS Modules, and Component CSS uses `styles.scss`. To get CSS Modules to use this format, we need another config, this time in `ember-cli-build.js`\n\n```\nconst nested = require('postcss-nested');\n// ...\ncssModules: {\n  extension: 'module.scss',\n  intermediateOutputPath: 'app/styles/_modules.scss',\n  plugins: {\n    before: [nested]\n  }\n},\n```\n\n> Notice that you need to install `postcss-nested` to allow for nested syntax and nested `:global` selector.\n\nNow in `app/styles/app.scss` you need to add the modules import after the pods import:\n\n```scss\n@import 'pod-styles.scss';\n@import 'modules';\n```\n\nDon't forget to also install `ember-css-modules-sass` to support SASS. And that should be it, let me know if you run into any issues on Twitter.","title":"Running Component CSS and CSS Modules in the Same App","date":"2020-01-03T23:02:29.750Z"},"relationships":{"authors":{"data":[{"type":"authors","id":"ilya"}]},"tags":{"data":[{"type":"tags","id":"ember-js"}]}}}}