{"data":{"type":"contents","id":"using-nested-routes-in-ember","attributes":{"html":"<p>In my <a href=\"https://ilyaradchenko.com/ember's-nested-routes-and-urls-explored\">last post</a> I mentioned how nested routes don't make sense sometimes, which means that they do have their uses at other times, which I want to cover here. I think the example I used in my last post wasn't clear enough, because what I meant to communicate is that if you want a nested URL structure, it doesn't always mean you need nested routes. I'd like to cover a scenarios that works really well with nested routes.</p>\n<h2 id=\"whenyouhavemanyresources\">When You Have Many Resources</h2>\n<p>The first is an app that is heavily CRUD (create read update delete) focused and has more than ~3 resources. In these scenarios it helps to nest, because you end up with a clean folder structure, e.g.</p>\n<ul>\n<li><code>app</code></li>\n<li><code>pods</code><ul>\n<li><code>users</code></li>\n<li><code>groups</code></li>\n<li><code>articles</code></li>\n<li><code>categories</code></li></ul></li>\n</ul>\n<p>Which I'd model like this in the router map:</p>\n<pre><code class=\"js language-js\">this.route('categories', function () {\n  // 'index' route is implicit and is for listing/filtering users\n  this.route('create');\n  this.route('category', { path: '/:categoryId' }, function () {\n    // 'index' route is implicit and is for viewing the user\n    this.route('edit');\n  });\n});\n</code></pre>\n<p>This pattern works really well because all sub-routes have access to the <code>users</code> route, and usually in ambitious CRUD apps you need to load some related dynamic data, like values for dropdowns that can be loaded at the top route and used with <code>this.modelFor('users')</code> in the child routes. This is usually useful in the <code>users.index</code> for filtering using a dropdown and in <code>users.create</code> and <code>users.user.edit</code> for selecting the value to create/update.</p>\n<p>At the <code>users.user</code> route, you'd load the actual model for viewing or editing, and the child routes would consume that via <code>modelFor</code>.</p>\n<p>This would create the following urls:</p>\n<ul>\n<li>/categories</li>\n<li>/categories/create</li>\n<li>/categories/1234</li>\n<li>/categories/1234/edit</li>\n</ul>\n<h2 id=\"whatabout\">What About… ?</h2>\n<p>The above works really well, but the idea is that it's about organizing items into related groups that are talking about one thing. So scenarios where you have public routes and authenticated routes will also fall in this category. Wizards that have steps that should be url accessible also should be nested. Routes are kind of like state machines, where sibling routes are the states that the parent route can be in, and the <code>index</code> is the initial state.</p>\n<p>If your UI is nested and needs to be URL accessible at the different levels of nesting, use nested routes.</p>","content":"In my [last post](https://ilyaradchenko.com/ember's-nested-routes-and-urls-explored) I mentioned how nested routes don't make sense sometimes, which means that they do have their uses at other times, which I want to cover here. I think the example I used in my last post wasn't clear enough, because what I meant to communicate is that if you want a nested URL structure, it doesn't always mean you need nested routes. I'd like to cover a scenarios that works really well with nested routes.\n\n## When You Have Many Resources\n\nThe first is an app that is heavily CRUD (create read update delete) focused and has more than ~3 resources. In these scenarios it helps to nest, because you end up with a clean folder structure, e.g.\n\n- `app`\n  - `pods`\n    - `users`\n    - `groups`\n    - `articles`\n    - `categories`\n\nWhich I'd model like this in the router map:\n\n```js\nthis.route('categories', function () {\n  // 'index' route is implicit and is for listing/filtering users\n  this.route('create');\n  this.route('category', { path: '/:categoryId' }, function () {\n    // 'index' route is implicit and is for viewing the user\n    this.route('edit');\n  });\n});\n```\n\nThis pattern works really well because all sub-routes have access to the `users` route, and usually in ambitious CRUD apps you need to load some related dynamic data, like values for dropdowns that can be loaded at the top route and used with `this.modelFor('users')` in the child routes. This is usually useful in the `users.index` for filtering using a dropdown and in `users.create` and `users.user.edit` for selecting the value to create/update.\n\nAt the `users.user` route, you'd load the actual model for viewing or editing, and the child routes would consume that via `modelFor`.\n\nThis would create the following urls:\n\n- /categories\n- /categories/create\n- /categories/1234\n- /categories/1234/edit\n\n## What About... ?\n\nThe above works really well, but the idea is that it's about organizing items into related groups that are talking about one thing. So scenarios where you have public routes and authenticated routes will also fall in this category. Wizards that have steps that should be url accessible also should be nested. Routes are kind of like state machines, where sibling routes are the states that the parent route can be in, and the `index` is the initial state.\n\nIf your UI is nested and needs to be URL accessible at the different levels of nesting, use nested routes.","title":"Using Nested Routes In Ember.js","date":"2019-12-06T14:19:07.652Z"},"relationships":{"authors":{"data":[{"type":"authors","id":"ilya"}]},"tags":{"data":[{"type":"tags","id":"ember-js"}]}}}}