{"data":{"type":"contents","id":"using-tags","attributes":{"html":"<p>empress-blog has a single, powerful organisational taxonomy, called tags.</p>\n<p>It doesn't matter whether you want to call them categories, tags, boxes, or anything else. You can think of tags a lot like Gmail labels. By tagging posts with one or more keyword, you can organise articles into buckets of related content.</p>\n<h2 id=\"basictagging\">Basic tagging</h2>\n<p>When you write a post, you can assign tags to help differentiate between categories of content. For example, you might tag some posts with <code>News</code> and other posts with <code>Cycling</code>, which would create two distinct categories of content listed on <code>/tag/news/</code> and <code>/tag/cycling/</code>, respectively.</p>\n<p>If you tag a post with both <code>News</code> <em>and</em> <code>Cycling</code> - then it appears in both sections.</p>\n<p>Tag archives are like dedicated home-pages for each category of content that you have. They have their own pages and <a href=\"https://github.com/empress/empress-blog/issues/1\">hopefully soon</a> will support their own cover images and meta data.</p>\n<h2 id=\"theprimarytag\">The primary tag</h2>\n<p>At the top of every post there is a tiny bit of YAML, and the tags key is an <a href=\"http://yaml.org/spec/1.0/#type-seq\">array</a> of tags. The first tag in the list is always given the most importance, and some themes will only display the primary tag (the first tag in the list) by default. So you can add the most important tag which you want to show up in your theme, but also add a bunch of related tags which are less important.</p>\n<pre><code class=\"yaml language-yaml\">tags:\n  - news\n  - cycling\n  - bart-stevens\n  - extreme-sports\n</code></pre>\n<p>In this example, <strong>News</strong> is the primary tag which will be displayed by the theme, but the post will also still receive all the other tags, and show up in their respective archives.</p>","content":"empress-blog has a single, powerful organisational taxonomy, called tags.\n\nIt doesn't matter whether you want to call them categories, tags, boxes, or anything else. You can think of tags a lot like Gmail labels. By tagging posts with one or more keyword, you can organise articles into buckets of related content.\n\n\n## Basic tagging\n\nWhen you write a post, you can assign tags to help differentiate between categories of content. For example, you might tag some posts with `News` and other posts with `Cycling`, which would create two distinct categories of content listed on `/tag/news/` and `/tag/cycling/`, respectively.\n\nIf you tag a post with both `News` *and* `Cycling` - then it appears in both sections.\n\nTag archives are like dedicated home-pages for each category of content that you have. They have their own pages and [hopefully soon](https://github.com/empress/empress-blog/issues/1) will support their own cover images and meta data.\n\n\n## The primary tag\n\nAt the top of every post there is a tiny bit of YAML, and the tags key is an [array](http://yaml.org/spec/1.0/#type-seq) of tags. The first tag in the list is always given the most importance, and some themes will only display the primary tag (the first tag in the list) by default. So you can add the most important tag which you want to show up in your theme, but also add a bunch of related tags which are less important.\n\n```yaml\ntags:\n  - news\n  - cycling\n  - bart-stevens\n  - extreme-sports\n```\n\nIn this example, **News** is the primary tag which will be displayed by the theme, but the post will also still receive all the other tags, and show up in their respective archives.","title":"Organising your content with tags","date":"Tue Jun 12 2018 17:57:10 GMT+0100 (IST)","featured":true,"image":"/images/tags.jpg","imageMeta":{"attribution":null,"attributionLink":null}},"relationships":{"authors":{"data":[{"type":"authors","id":"ghost"}]},"tags":{"data":[{"type":"tags","id":"getting-started"}]}}}}